//-----------------------------------------------------------------
//  名称: DS1302 实时时钟程序
//-----------------------------------------------------------------
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//DS1302引脚定义
#define IO   PA0
#define SCLK PA1
#define RST  PA2

//DS1302端口定义
#define DS_PORT  PORTA
#define DS_DDR   DDRA
#define DS_PIN   PINA

//DS1302端口数据读写(方向)





//DS1302控制引脚操作定义












//0,1,2,3,4,5,6分别对应周日,周一至周六
char *WEEK[] = {"SUN","MON","TUS","WEN","THU","FRI","SAT"};
//所读取的日期时间
INT8U DateTime[7];
//-----------------------------------------------------------------
// 向DS1302写入一字节
//-----------------------------------------------------------------
void Write_Byte_TO_DS1302(INT8U x) 
{ 






}

//-----------------------------------------------------------------
// 从DS1302读取一字节
//-----------------------------------------------------------------
INT8U Get_Byte_FROM_DS1302() 
{ 








}

//-----------------------------------------------------------------
// 从DS1302指定位置读数据
//-----------------------------------------------------------------
INT8U Read_Data(INT8U addr)
{








}

//-----------------------------------------------------------------
// 读取当前日期时间
//-----------------------------------------------------------------
void GetDateTime() 
{












}
