//-----------------------------------------------------------------
//  名称: 液晶屏曲线显示两路模数转换结果
//-----------------------------------------------------------------
//  说明: 本例运行时,AD转换端口的两路模数转换结果除以数字方式显示
//        在液晶屏上以外,变化过程还会以曲线方式呈现出来.
//                          
//-----------------------------------------------------------------
#include <avr/io.h>
#include <util/delay.h>
#include <stdio.h>
#include <math.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//PG160128相关函数
extern void LCD_Initialise();
extern void Display_Str_at_xy(INT8U x,INT8U y,char *Buffer,INT8U wb);
extern void Line(INT8U x1,INT8U y1,INT8U x2,INT8U y2,INT8U Mode);
//LCD字符串显示缓冲
char Disp_Str_Buffer[14];
//-----------------------------------------------------------------
// 对通道CH进行模数转换
//-----------------------------------------------------------------
INT16U ADC_Convert(INT8U CH)
{


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{




}
