//-----------------------------------------------------------------
//  名称: 用AVR与1601LCD设计的计算器
//-----------------------------------------------------------------
//  说明: 本例运行时,可完成整数的加、减、乘、除四种运算,该计算器
//        不支持带优先级的表达式运算,但允许连续进行整数运算.
//        如果运算结果超出有效范围则显示*ERR*
//
//-----------------------------------------------------------------
#include <avr/io.h>
#include <avr/pgmspace.h>
#include <util/delay.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <ctype.h>
#include "LCD1601.h"
#define INT8U unsigned char

//蜂鸣器及键盘相关定义




//计算器相关变量,状态及字符表定义



//-----------------------------------------------------------------
// 根据操作符完成运算或清屏等操作
//-----------------------------------------------------------------
void Operator_Process(char OP)
{ 



}

//-----------------------------------------------------------------
// 蜂鸣器输出提示音
//-----------------------------------------------------------------
void Sounder()
{ 


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{



}
