//-----------------------------------------------------------------
//  名称: 红外遥控器受控端程序
//-----------------------------------------------------------------
//  说明: 程序运行时,根据SONY红外协议接收数据并解码,然后根据接收到
//        的不同编码完成不同操作.
//  
//-----------------------------------------------------------------
#define F_CPU 2000000UL
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#include <stdio.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//端口设备操作定义




//读取红外输入信号


//当前速度值(初始值设为200)


//当前接收到的12位红外编码



//液晶屏相关函数


//当前速度显示缓冲
char Speed_Disp_Buff[10];
//-----------------------------------------------------------------
// PWM调速并显示
//-----------------------------------------------------------------
void PWM_speed_and_show() 
{     


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{


}

//-----------------------------------------------------------------
// INT0中断函数 (通过实测,以122,242为两个时长的上限)
//-----------------------------------------------------------------
ISR (INT0_vect) 
{     



}
