//-----------------------------------------------------------------
//  名称: TG126410液晶串行模式演示
//-----------------------------------------------------------------
//  说明: 本例用按键与开关控制TG126410显示不同画面,LCD工作于串行模式.
//        本例所显示的几幅画面常用于对液晶屏进行显示测试.
//               
//-----------------------------------------------------------------
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//按键定义





//总画面数及当前画面页索引
INT8U MaxPage = 7, CurrentPageIndex = 0;
//控制是否继续显示下一幅图像的标识变量
enum {FALSE,TRUE} ShowNext = FALSE;

//12864LCD显示与屏幕测试相关函数







//-----------------------------------------------------------------
// 按键扫描
//-----------------------------------------------------------------
void Scan_KEYs()
{










}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{














}
