//-----------------------------------------------------------------
//  名称: 基于485通信的单片机程序
//-----------------------------------------------------------------
//  说明: 本例运行时,PC机通过串口发送的数字串的前四位将显示在数码管上.
//
//-----------------------------------------------------------------
#define  F_CPU   4000000UL //4M晶振
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

#define MAXLEN 4              //可接收数字的最大个数
struct                        //数字串接收缓冲结构类型
{
   INT8U Buf_array[MAXLEN];   //缓冲空间
   INT8U Buf_Len;             //当前缓冲长度
} Receive_Buffer;             //接收缓冲变量

INT8U Clear_Buffer_Flag = 0;  //清空缓冲标志

//共阳数码管0~9的段码表,最后一位为黑屏
const INT8U SEG_CODE[] = 
{0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,0x00};

//------------------------------------------------------------------
// USART初始化
//------------------------------------------------------------------
void Init_USART()
{		



}

//------------------------------------------------------------------
// 显示所接收数字串的前四位(数字串由PC串口发送,单片机串口接收)
//------------------------------------------------------------------
void Show_Received_Digits()
{


}

//------------------------------------------------------------------
// 主程序
//------------------------------------------------------------------
int main() 
{ 


}

//-----------------------------------------------------------------
// 串口接收中断函数(接收PC机数据)
//-----------------------------------------------------------------
ISR (USART_RXC_vect)
{


}
