//-----------------------------------------------------------------
//  名称: DS18B20温度传感器程序
//-----------------------------------------------------------------
#include <avr/io.h>
#include <util/delay.h>
#define INT8    signed char     //有符号字节整数
#define INT8U   unsigned char
#define INT16U  unsigned int

//DS18B20引脚定义


//设置数据方向


//温度管引脚操作定义



//温度小数表(低字节中的低四位对应16个小数位)




//传感器状态标志
volatile INT8U DS18B20_ERROR = 0;
//从DS18B20读取的2字节当前温度数据(需要转换才能得到当前有符号温度值)
volatile INT8U Temp_Value[] = {0x00,0x00};
//以下两变量的值由Temp_Value中的2字节转换而来.
//当前读取的温度整数部分(有符号字节整数)    
volatile INT8  Curr_int_temp = 0; 
//当前读取的温度小数部分(仅用于附在整数后面显示,不需要再设为有符号)
volatile INT8U Curr_df_temp = 0;  
//-----------------------------------------------------------------
// 初始化DS18B20 
//-----------------------------------------------------------------
INT8U Init_DS18B20()
{


}

//-----------------------------------------------------------------
// 读一字节 
//-----------------------------------------------------------------
INT8U ReadOneByte()
{


}

//-----------------------------------------------------------------
// 写一字节 
//-----------------------------------------------------------------
void WriteOneByte(INT8U dat)
{


}

//-----------------------------------------------------------------
// 读取温度值 
//-----------------------------------------------------------------
void Read_Temperature()
{


}

//-----------------------------------------------------------------
// 温度数据转换
//-----------------------------------------------------------------
void Convert_Temp_Data()
{


}
