//-----------------------------------------------------------------
//  名称: 用8255实现接口扩展
//-----------------------------------------------------------------
//  说明: 8255的PA、PB端口分别连接8位数码管的段码和位码,
//        PC端口连接三只按键,正常运行时数码管显示一组时间值,
//        PC端口的三只按键可对时间值的各部分分别进行调整.
//
//-----------------------------------------------------------------
#define F_CPU 2000000UL
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//PA,PB,PC端口及命令端口地址定义







//0-9的共阳数码管段码表,最后的0xBF表示"-"
const INT8U SEG_CODE[] =
{ 0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90,0xBF };
//待显示信息缓冲12-30-50
INT8U Disp_Buffer[] = {1,2,10,3,0,10,5,0};
//上次按键状态
INT8U Pre_Key_State = 0x00;
//-----------------------------------------------------------------
// 8255PC端口按键处理
//-----------------------------------------------------------------
void Key_Process()
{














	
}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{	














}
