//-----------------------------------------------------------------
//  名称: IIC-AT24C1024*2硬字库应用
//-----------------------------------------------------------------
//  说明: 本例运行时,液晶屏将显示几行文字,这些文字的点阵由本例
//        程序自动从2片AT24C1024中读取.
//                          
//-----------------------------------------------------------------
#include <avr/io.h>
#include <util/delay.h>
#include <string.h>
#define INT8U   unsigned char
#define INT16U  unsigned int
#define INT32U  unsigned long

//12864LCD相关函数

//IIC相关函数


//从汉字库取得的一个汉字的点阵存放区
INT8U Word_Dot_Matrix[32];
//转换为LCD显示格式的汉字点阵存放区
INT8U LCD_Dot_Matrix[32];
//-----------------------------------------------------------------
// 读取IIC字库点阵并转换为本例液晶屏汉字取模格式
//-----------------------------------------------------------------
void Read_IIC_Word_DotMatrix_AND_Convert_TO_LCD_Fmt(INT8U c[])
{  


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{
    INT8U i,j;
    //Poem中可输入任意文字,注意输入标点符号或英文数字时必须采用全角方式
	//关于中英文及全/半角混合支持可参考"多汉字点阵屏"案例中的相关代码
    const char Poem[][15] = 
    { 
       "采菊东篱下，",
       "悠然见南山。",
       "此中有真意，",
       "欲辨已忘言。"
    };









}
