//-----------------------------------------------------------------
//  名称: 正反转可控的直流电机
//-----------------------------------------------------------------
//  说明: 本例运行时,按下K1直流电机正转,按下K2直流电机反转,
//        按下K3时停止. 在进行相应操作时,对应LED将被点亮.
//               
//-----------------------------------------------------------------
#define F_CPU 4000000UL
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//按键定义



//LED定义



//电机控制端A,B操作定义



//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main(void)
{



}
