//-----------------------------------------------------------------
// 名称: LCD1602液晶控制与显示程序
//-----------------------------------------------------------------
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//LCD控制引脚定义
#define RS PB0                              //寄存器选择
#define RW PB1                              //读/写
#define E  PB2                              //使能

//LCD控制端口定义
#define LCD_CRTL_PORT PORTB

//LCD数据端口定义
#define LCD_PORT  PORTC                     //发送LCD数据端口
#define LCD_PIN   PINC                      //读取LCD数据端口
#define LCD_DDR   DDRC                      //LCD数据端口方向

//LCD控制引脚操作定义

















//-----------------------------------------------------------------
// LCD忙等待 
//-----------------------------------------------------------------
void LCD_BUSY_WAIT()
{





}

//-----------------------------------------------------------------
// 写LCD命令寄存器
//-----------------------------------------------------------------
void Write_LCD_Command(INT8U cmd)
{






}

//-----------------------------------------------------------------
// 写LCD数据寄存器
//-----------------------------------------------------------------
void Write_LCD_Data(INT8U dat)
{






}

//-----------------------------------------------------------------
// LCD初始化
//-----------------------------------------------------------------
void Initialize_LCD()
{





}

//-----------------------------------------------------------------
// 显示字符串
//-----------------------------------------------------------------
void LCD_ShowString(INT8U x, INT8U y,char *str)
{







}
