//-----------------------------------------------------------------
//  名称: 温控电机在L298N驱动下改变速度与方向运行
//-----------------------------------------------------------------
//  说明: 本例运行过程中:
//        1. 外界温度在45℃以上时电机加速正转/小于10℃时加速反转
//        2. 温度达到75℃及以上时电机全速正转/温度在0℃及以下时达到全速反转
//        3. 温度回到10℃至45℃之间时电机快速过渡到停止状态
//        4. 通过虚拟示波器可观察PWM波形
//
//-----------------------------------------------------------------
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#include <string.h>
#include <stdio.h>
#define INT8    signed char
#define INT8U   unsigned char
#define INT16U  unsigned int

//温度传感器相关函数及相关变量



//液晶相关函数



//L298N控制引脚操作定义


//-----------------------------------------------------------------
// 主函数
//-----------------------------------------------------------------
int main()
{    



}

//-----------------------------------------------------------------
// 定时器中断,持续读取当前温度,刷新LCD显示并控制L298N变速变向运行
//-----------------------------------------------------------------
ISR (TIMER0_OVF_vect)
{


}
