//-----------------------------------------------------------------
//  名称: 16段数码管演示
//-----------------------------------------------------------------
//  说明: 本例运行时,8只集成式16段数码管在按键控制下依次显示
//        几组英文与数字字符串.
//        本例16段数码管段码表编码规则见程序内说明.
//  
//-----------------------------------------------------------------
#define  F_CPU   4000000UL
#include <avr/io.h>
#include <util/delay.h>
#include <ctype.h>
#include <string.h>
#include <math.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//本例编码按数码管各段字母顺序设计编码(先外框循环,后内部米字循环):
//A1 A2 B C D2 D1 E F H I J G2 K I M G1 DP(编码时注意逆向)
const INT16U SEG_CODE16[] = //16段共阳数码管段码表(本例用的是共阴数码管,输出时要取反)
{ //以下编码中“S”与“5”，“O”与“0”的显示是相同的，大家可根据需要自行修改 
  0xff00,0xfff3,0x7788,0x77c0,0x7773,0x7744,0x7704,0xfff0,0x7700,0x7740,//0-9  
  0x7730,0x7304,0xff0c,0xddc0,0x770c,0x773c,0xf704,0x7733,0xddcc,0xdd9c,//A-J
  0x6b3f,0xff0f,0xfa33,0xee33,0xff00,0x7738,0xef00,0x6738,0x7744,0xddfc,//K-T
  0xff03,0xbb3f,0xaf33,0xaaff,0xdaff,0xbbcc                             //U-Z
};
//待显示字符串
char str_buffer[] = "DIST 950abcdefghijKLMNOPQRSTUVWXYZ 0123456789";
//------------------------------------------------------------------
// 获取字符的16位段码
//------------------------------------------------------------------
INT16U get_16_segcode(char c)
{







}

//------------------------------------------------------------------
// 主程序
//------------------------------------------------------------------
int main() 
{ 
















}
