//-----------------------------------------------------------------
//  名称: LCD12864显示驱动程序 (不带字库)
//-----------------------------------------------------------------
#include <avr/io.h>
#include <avr/pgmspace.h>
#include <util/delay.h>
#include <string.h>
#define INT8U   unsigned char
#define INT16U  unsigned int
//液晶起始行,页,列命令定义
#define LCD_START_ROW   0xC0      //起始行
#define LCD_PAGE        0xB8      //页指令
#define LCD_COL         0x40      //列指令
//液晶控制引脚
#define RW              PB0       //读写
#define DI              PB1       //数据/命令选择
#define E               PB2       //使能
#define CS1             PB3       //左半屏选择
#define CS2             PB4       //右半屏选择
#define RST             PB5       //复位
//液晶端口
#define LCD_PORT        PORTA     //液晶DB0-DB7
#define LCD_DDR         DDRA      //设置数据方向
#define LCD_PIN         PINA      //读状态数据
#define LCD_CTRL        PORTB     //液晶控制端口
//液晶引脚操作定义











//是否反相显示(白底黑字/黑底白字,不同背光的液晶会有不同)
INT8U Reverse_Display = 0;
//-----------------------------------------------------------------
// 等待液晶就绪
//-----------------------------------------------------------------
void Wait_LCD_Ready()
{


}

//-----------------------------------------------------------------
// 向LCD发送命令
//-----------------------------------------------------------------
void LCD_Write_Command(INT8U cmd)
{


}

//-----------------------------------------------------------------
// 向LCD发送数据
//-----------------------------------------------------------------
void LCD_Write_Data(INT8U dat)
{


}

//-----------------------------------------------------------------
// 初始化LCD
//-----------------------------------------------------------------
void LCD_Initialize()
{


}

//-----------------------------------------------------------------
//
// 通用显示函数
// 
// 从第P页第L列开始显示W个字节数据,数据在r所指向的缓冲
// 每字节8位是垂直显示的,高位在下,低位在上
// 每个8*128的矩形区域为一页
// 整个LCD又由64x64的左半屏和64x64的右半屏构成
//-----------------------------------------------------------------
void Common_Show(INT8U P,INT8U L,INT8U W,prog_uchar *r)
{


}

//-----------------------------------------------------------------
// 显示一个8×16点阵字符
//-----------------------------------------------------------------
void Display_A_Char_8X16(INT8U P,INT8U L,prog_uchar *M)
{


}

//-----------------------------------------------------------------
// 显示一个16×16点阵汉字
//-----------------------------------------------------------------
void Display_A_WORD(INT8U P,INT8U L,prog_uchar *M)
{


}

//-----------------------------------------------------------------
// 显示一串16×16点阵汉字
//-----------------------------------------------------------------
void Display_A_WORD_String(INT8U P,INT8U L,INT8U C,prog_uchar *M)
{


}
