//-----------------------------------------------------------------
// 名称: MMC卡块读写程序
//-----------------------------------------------------------------
#define F_CPU 4000000UL
#include <avr/io.h>
#include <util/delay.h>
#define INT8U  unsigned char
#define INT16U unsigned int
#define INT32U unsigned long

//MMC卡使能与禁止操作




//块字节读写缓冲(512字节)
extern INT8U Block_bytes[512];
//写SPI接口函数
extern INT8U SPI_Send(INT8U data);

//MMC卡操作命令帧(6字节,48位)


//-----------------------------------------------------------------
// MMC命令帧清0
//-----------------------------------------------------------------
void clear_cmd_frame()
{


}

//-----------------------------------------------------------------
// 写MMC命令
//-----------------------------------------------------------------
INT8U MMC_Write_Command(INT8U *cmd_frame)
{


}

//-----------------------------------------------------------------
// MMC初始化
//-----------------------------------------------------------------
INT8U MMC_Initialise()
{


}

//-----------------------------------------------------------------
// 从address地址读取单个块字节数据
//-----------------------------------------------------------------
INT8U MMC_Read_Block(INT32U address)
{


}
	
//-----------------------------------------------------------------
// 向address地址开始写入单个块字节数据(buffer为数据缓冲指针)
//-----------------------------------------------------------------
INT8U MMC_Write_Block(INT32U address,INT8U *buffer)
{


}
