//-----------------------------------------------------------------
//  名称:射击训练游戏
//-----------------------------------------------------------------
//  说明:程序启动时液晶屏显示游戏封面,然后显示游戏区,默认弹药为20发,
//       K1,K2键用于向上或向下移动枪支,跟踪目标,K3用于发射并模拟枪声,
//       在每次发射时,如果击中则加1分,在击中后如果目标物体尚未移动时,
//       程序不重复加分.弹药用完后可按下K4重新开始. 
//-----------------------------------------------------------------
#define F_CPU 4000000UL
#include <avr/io.h>
#include <avr/pgmspace.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#include <stdio.h>
#include <stdlib.h>
#include "PG160128.h"
#include "PictureDots.h"
#define INT8U  unsigned char
#define INT16U unsigned int 

//LCD显示相关函数及相关变量






//按键定义


//蜂鸣器



INT8U HCount = 0,LCount = 0;         //控制模拟枪声的延时变量
INT8U Score = 0, Bullet_Count = 20;  //得分,剩余弹药数 
INT8U Target_x = 0, Target_y = 0;    //目标物体位置
INT8U Pre_Target_y = 0;              //目标物体上次所在纵坐标位置
INT8U gun_y = 20;                    //枪支纵坐标(其中横坐标固定为16*8)
//-----------------------------------------------------------------
// 显示成绩与剩余弹药数
//-----------------------------------------------------------------
void Show_Score_and_Bullet()
{


} 

//-----------------------------------------------------------------
// 键盘中断(INT1)
//-----------------------------------------------------------------
ISR (INT1_vect)
{
    //枪支位置上移-------------------------------------------------



    //枪支位置下移-------------------------------------------------



    //发射,绘制与擦除弹道线条,模拟枪声,判断成绩--------------------



    //成绩与弹药数复位---------------------------------------------



}

//-----------------------------------------------------------------
// 定时器0溢出中断控制目标物体随机移动
//-----------------------------------------------------------------
ISR (TIMER0_OVF_vect)
{



//-----------------------------------------------------------------
// 定时器1溢出中断模拟枪声输出
//-----------------------------------------------------------------
ISR (TIMER1_OVF_vect)
{


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{    


}
