//-----------------------------------------------------------------
//  名称: 用数码管与DS18B20设计温度报警器
//-----------------------------------------------------------------
//  说明: 本例将报警温度设为高:70, 低:-20,当DS18B20感知到温度达到此
//        临界值时相应的LED闪烁,同时系统发出报警声.
//
//-----------------------------------------------------------------
#define F_CPU 1000000UL
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#define INT8    signed   char
#define INT8U   unsigned char
#define INT16U  unsigned int

//双色自闪烁LED及蜂鸣器定义



//DS18B20相关函数与变量



//MAX695X引脚操作定义



//在非解码模式下MAX6950/1对应的段码表,此表不同于直接驱动时所使用的段码表
//原来的各段顺序是：   DP,G,F,E,D,C,B,A
//用MAX6950/1驱动顺序：DP,A,B,C,D,E,F,G
//除小数点位未改变外，其他位是逆向排列的.
//下表中最后一位为黑屏
const INT8U SEG_CODE_695X[] = 
  {0x7E,0x30,0x6D,0x79,0x33,0x5B,0x5F,0x70,0x7F,0x7B,0x00};
//报警标志
INT8U HI_Alarm = 0, LO_Alarm = 0; 
//待显示的各温度数位,显示格式:-XX.X℃ / XXX.X℃ (-55.0 ~ 125.0)
INT8U Temp_Display_Buffer[] = {0x00,0x00,0x00,0x00,0x63,0x4E};
//-----------------------------------------------------------------
// 向MAX695X写数据
//-----------------------------------------------------------------
void Write(INT8U Addr,INT8U Dat)
{


}

//-----------------------------------------------------------------
// MAX695X初始化
//-----------------------------------------------------------------
void Init_MAX695X()
{


}

//-----------------------------------------------------------------
// 温度显示,报警启停控制
//-----------------------------------------------------------------
void Temp_display_and_alarm()
{ 


    HI_Alarm = i_sign * i_curr_Temp >= Alarm_Temp_HL[0] ? 1 : 0;
    LO_Alarm = i_sign * i_curr_Temp <= Alarm_Temp_HL[1] ? 1 : 0;
}

//-----------------------------------------------------------------
// 定时器T0溢出中断持续读取温度管数据
// 并控制报警输出及数码管显示
//-----------------------------------------------------------------
ISR (TIMER0_OVF_vect)
{


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{


}
