//-----------------------------------------------------------------
//  名称: 用内置EEPROM与1602液晶设计的带MD5加密的电子密码锁
//-----------------------------------------------------------------
//  说明: 初始密码由Passwrod.BIN设定为:
//        "e10adc3949ba59abbe56e057f20f883e",它由明文密码"123456"进行
//         MD5加密后得到.
//
//        数字键0-9中用于输入密码,密码不超过10位,输入完成后按下
//        "开锁键"开锁,密码正确时LED点亮,液晶屏显示开锁成功.
//        另外,本例还具备:上锁,重新输入密码,保存新密码,清除等功能.
//        重设密码时要求先输入正确的密码并成功开锁.
//           
//-----------------------------------------------------------------
#include <avr/io.h>
#include <avr/eeprom.h>
#include <util/delay.h>
#include <string.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//电子锁指示灯开关定义


//蜂鸣器



//液晶相关函数
extern void Initialize_LCD();
extern void LCD_ShowString(INT8U x, INT8U y,char *str);
//MD5加密函数
extern char* MD5String(char *str);
//键盘扫描相关函数即按键键值
extern INT8U Keys_Scan();
extern INT8U KeyMatrix_Down();
extern INT8U KeyNo;

//LCD提示字符串
const char *Title_Text = "Your Password...";
//显示缓冲
char DSY_BUFFER[10] = "";
//保存在EEPROM中的密码(MD5加密密码,其长度为32位)
char EEPROM_Password[33];
//用户输入的密码(密码不超过10位)
char UserInputPassword[11];
//-----------------------------------------------------------------
// 蜂鸣器子程序
//-----------------------------------------------------------------
void Sounder()
{

  
}

//-----------------------------------------------------------------
// 清除密码
//-----------------------------------------------------------------
void Clear_Password()
{


}

//-----------------------------------------------------------------
// 读取EEPROM中的密码(以'\0'或0xFF为结果标志)
//-----------------------------------------------------------------
void Read_EEPROM_Password()
{


}

//-----------------------------------------------------------------
// 将新密码保存到EEPROM,为便于读者调试观察,
// 本函数同时保存了新密码的明文和密文,保存位置分别为:0x0050,0x0000)
//-----------------------------------------------------------------
void Save_Password_TO_EEPROM()
{


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{
   INT8U i = 0;
   INT8U IS_Valid_User = 0;      
   DDRA = 0xFF; PORTA = 0xFF;             //配置端口
   DDRC = 0xFF;
   DDRD = 0xFF;
   LED_OFF();                             //初始时关闭LED指示灯 
   Initialize_LCD();                      //LCD初始化
   LCD_ShowString(0,0,(char*)Title_Text); //在第0行显示提示信息
      
   //AVR EEPROM的密码已由初始化Password.BIN文件导入
   //下面将EEPROM中预设的密码读入EEPROM_Password
   Read_EEPROM_Password();
   while(1)
   { 





   } 
}
