//-----------------------------------------------------------------
//  名称: MPX4250压力传感器测试
//-----------------------------------------------------------------
//  说明: 本例运行时,MPX4250通过PA7向单片机输入模拟电压,经模数
//        转换并通过公式换算后,数码管将显示出当前压力值.
//
//-----------------------------------------------------------------
#define  F_CPU  4000000UL 
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//共阴数码管0-9的数字编码,最后一位为黑屏
const INT8U SEG_CODE[] = 
{ 0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F,0x00 };
//分解后的待显示数位段码缓冲(第一位是大写字母P.)
INT8U SEG_Display_Buffer[] = {0xF3,0,0,0};
//-----------------------------------------------------------------
// 数码管显示压力
//-----------------------------------------------------------------
void Show_PRESS_ON_DSY()
{   

} 

//------------------------------------------------------------------
// 主程序
//------------------------------------------------------------------
int main() 
{ 


}
