//-----------------------------------------------------------------
//  名称:用1602LCD与DS18B20设计的温度报警器
//-----------------------------------------------------------------
//  说明:本例运行时,如果按下K1,K2,K3可分别显示ROMCODE,报警温度上下限,
//       以及实时显示当前温度,在当前温度在70 ~ -20℃之外时报警指示灯
//       闪烁,并同时输出报警声音.
//
//-----------------------------------------------------------------
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#include <string.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//液晶相关函数



//温度传感器相关函数与相关变量



//按键定义



//报警指示灯操作定义



//蜂鸣器定义
#define BEEP() PORTD ^= _BV(PD7)
//当前操作码,初始设3,默认进行温度显示与报警,主程序与中断函数
//共享此变量,注意添加volatile.
volatile INT8U curr_op = 3;
//-----------------------------------------------------------------
// 主函数
//-----------------------------------------------------------------	
int main()
{


}

//-----------------------------------------------------------------
// INT1中断根据不同按键选择不同操作代号
//-----------------------------------------------------------------
ISR (INT1_vect)
{


}

//-----------------------------------------------------------------
// 定时器中断,控制警报声音输出及对应指示灯闪烁
//-----------------------------------------------------------------
ISR (TIMER0_OVF_vect)
{


}
