//-----------------------------------------------------------------
//  名称: 看门狗应用
//-----------------------------------------------------------------
//  说明: 本例系统启动时,LED1点亮,正常运行时,LED1熄灭,LED2开始闪烁
//        程序设置看门狗溢出时间为:1.9s,定时器必须在此时间内复位
//        看门狗(喂狗),否则会引起系统复位,LED1再次点亮后熄灭,LED2
//        重新开始持续闪烁.
//
//-----------------------------------------------------------------
#define F_CPU   1000000UL
#include <avr/io.h>
#include <avr/interrupt.h>
#include <avr/wdt.h>                       //看门狗相关头文件
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//分别定义LED1开/关,LED2闪烁




//------------------------------------------------------------------
// 主程序
//------------------------------------------------------------------
int main() 
{ 




} 

//-----------------------------------------------------------------
// 定时器1中断程序负责喂狗(1.9s以内)
//-----------------------------------------------------------------
ISR (TIMER1_OVF_vect)
{




}

//-----------------------------------------------------------------
// INT0中断函数(按下K1时关闭定时器,停止喂狗)
//-----------------------------------------------------------------
ISR (INT0_vect)
{


}
