//-----------------------------------------------------------------
//  名称: 能接收串口信息的带中英文硬字库的80*16点阵显示屏
//-----------------------------------------------------------------
//  说明: 本例运行时,点阵屏将滚动显示一组固定信息
//        当接收到串口发送来的中英文/全角/半角字符时,点屏将开始
//        滚动显示所接收到的信息.
//                          
//-----------------------------------------------------------------
#define F_CPU 4000000UL
#include <avr/io.h>
#include <avr/interrupt.h>
#include <string.h>
#include <stdio.h>
#include <util/delay.h>
#define INT8    signed   char
#define INT8U   unsigned char
#define INT16U  unsigned int
#define INT32U  unsigned long

//74595及74154相关引脚定义



//74595及74154相关引脚操作



//74154译码器使能与禁止



//SPI相关函数



//最多可接收的汉字个数
#define MAX_WORD_COUNT 50
//开始时待显示的中英文字符串
//及从串口接收的中英文数字等字符信息都将覆盖保存到bMsg中
struct MSG
{
   INT8U  Buffer[MAX_WORD_COUNT*2 + 2];
   INT16U Len;
} bMsg;

//缓冲可保存汉字点阵数据的最大汉字个数(如果为半角字符则*2)
#define MAX_DOT_WORD_COUNT 20
//待显示汉字点阵数据缓冲
INT8U WORD_Dots_Buffer[MAX_DOT_WORD_COUNT * 32];
//------------------------------------------------------------------
// USART初始化
//------------------------------------------------------------------
void Init_USART()
{    


}

//-----------------------------------------------------------------
// 串行输入子程序
//-----------------------------------------------------------------
void Serial_Input_595(INT8U dat)
{

  
}

//-----------------------------------------------------------------
// 并行输出子程序
//-----------------------------------------------------------------
void Parallel_Output_595()
{


}

//-----------------------------------------------------------------
// 根据bMsg.Buffer,从硬字库读取全角或半角字符点阵数据并完成必要转换
//-----------------------------------------------------------------
void Read_SPI_Word_Dot_Matrix_AND_Convert()
{  



}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{



}

//-----------------------------------------------------------------
// 串口接收中断函数
//-----------------------------------------------------------------
ISR (USART_RXC_vect)
{


}
