//-----------------------------------------------------------------
//  名称: 数码管BCD解码驱动器7447与4511应用
//-----------------------------------------------------------------
//  说明: BCD码经7447或4511译码后输出数码管段码，实现数码管显示
//     	  （7447驱动共阳数码管,本例用的是共阴数码管,因此需要反相,
//          4511驱动共阴极数码管）
//
//-----------------------------------------------------------------
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//待显示的数字串"18 43 25"和"2015 7 6",其中00xFF是不显示的.
const INT8U BCD_CODE[] = {1,8,0xFF,4,3,0xFF,2,5,2,0,1,5,0xFF,7,0xFF,6,};
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{



















}

