//-----------------------------------------------------------------
//  名称: 用TIMER1输入捕获功能设计的频率计
//-----------------------------------------------------------------
//  说明: 本例运行时,切换不同的频率输入,然后按下K1按键,数码管上将
//        显示当前频率值.两次捕获的时间差值即为当前输入频率的周期,
//        周期倒数即可得到当前频率.
//
//-----------------------------------------------------------------
#define  F_CPU  1000000UL //1M晶振
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//共阴数码管0-9的数字编码,最后一位为黑屏
const INT8U SEG_CODE[] = 
{0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F,0x00};

//分解后的待显示数位
INT8U Display_Buffer[] = {0,0,0,0};

//连续两次捕获计数变量


//-----------------------------------------------------------------
// 数码管显示频率
//-----------------------------------------------------------------
void Show_FRQ_ON_DSY()
{ 

} 
  
//------------------------------------------------------------------
// 主程序
//------------------------------------------------------------------
int main() 
{ 

} 

//------------------------------------------------------------------
// T1输入捕获中断子程序
//------------------------------------------------------------------
ISR (TIMER1_CAPT_vect)
{



}
