//-----------------------------------------------------------------
//  名称: 用定时器设计的门铃
//-----------------------------------------------------------------
//  说明: 按下按键时蜂鸣器发出叮咚的门铃声
//
//-----------------------------------------------------------------
#define F_CPU  1000000UL //1M晶振
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

#define DoorBell() (PORTD ^= 0x01)          //门铃定义
#define Key_DOWN() ((PINB & 0x80) == 0x00)  //按键定义
volatile INT16U soundDelay;                 //两个不同取值分别对应于"叮","咚"
//------------------------------------------------------------------
// 主程序
//------------------------------------------------------------------
int main() 
{ 


}

//-----------------------------------------------------------------
// T1定时器中断程序控制门铃
//-----------------------------------------------------------------
ISR ( TIMER1_OVF_vect )
{

}
