//-----------------------------------------------------------------
//  名称: 1602LCD字符液晶测试程序
//-----------------------------------------------------------------
//  说明: 本例运行时,LCD第一行显示静态字符串,第二行显示键盘矩阵
//        所输入的字符,程序支持空格输入,退格和清除.
//                          
//-----------------------------------------------------------------
#include <avr/io.h>
#include <string.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//可显示的字符表(最后一位是空格符)(分别对应:0x00~0x0D)
const char CHAR_Table[] = "0123456789+-= ";
//待显示字符串
char Disp_String[17];
//有键按下
#define Key_Pressed() ((PIND & _BV(PD4)) != 0x00)
//键值
#define KEY_VALUE (PIND & 0x0F)

//液晶相关函数
extern void Initialize_LCD();
extern void LCD_ShowString(INT8U x, INT8U y,char *str);
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{






















}
