//-----------------------------------------------------------------
//  名称: 用工作于计数方式的TC0实现100以内的脉冲或按键计数
//-----------------------------------------------------------------
//  说明: TC0工作于计数器方式且设为下降沿触发,外部的每次按键或脉冲
//        出现的下降沿都将导致TCNT0累加计数一次,TCNT0的计数值将被实时
//        刷新并显示在两位数码管上.
//
//-----------------------------------------------------------------
#define  F_CPU   4000000UL //4M晶振
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//清除键定义
#define Clear_Key_DOWN() ((PINB & 0x40) == 0x00)

//0-9的数字编码
const INT8U SEG_CODE[] = {0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F};
//-----------------------------------------------------------------
// 在数码管上显示计数值
//-----------------------------------------------------------------
void Show_Count_ON_DSY()
{   



} 

//------------------------------------------------------------------
// 主程序
//------------------------------------------------------------------
int main() 
{ 



} 
