//-----------------------------------------------------------------
//  名称: SPI-AT25F2048硬件字库应用
//-----------------------------------------------------------------
//  说明: 本例与上一案例的差别在于字库存放在兼容SPI接口的AT25F2048
//        存储器中.
//     
//-----------------------------------------------------------------
#include <avr/io.h>
#include <string.h>
#define INT8U   unsigned char
#define INT16U  unsigned int
#define INT32U  unsigned long

//12864LCD相关函数


//SPI相关函数



//从汉字库取得的一个汉字的点阵存放区
INT8U Word_Dot_Matrix[32];
//转换为LCD显示格式的汉字点阵存放区
INT8U LCD_Dot_Matrix[32];
//-----------------------------------------------------------------
// 读取SPI字库汉字点阵并将字库点阵格式转换为本例液晶屏汉字取模格式
//-----------------------------------------------------------------
void READ_SPI_Word_DotMatrix_AND_Convert_TO_LCD_Fmt(INT8U c[])
{  



}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{


}
