//-----------------------------------------------------------------
//  名称: 正反转可控的步进电机
//-----------------------------------------------------------------
//  说明: 本例运行过程,按下K1电机正转3圈,按下K2反转3圈,
//        按下K3时停止.在进行相应操作时,对应LED将被点亮.
//               
//-----------------------------------------------------------------
#define F_CPU 4000000UL
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//本例四相步进电机工作于八拍方式
//正转励磁序列为A->AB->B->BC->C->CD->D->DA


//反转励磁序列为A->AD->D->CD->C->BC->B->AB



//按键定义


//-----------------------------------------------------------------
// 步进电机正转或反转n圈(本例步进电机在8拍方式下每次步进45度角)
//-----------------------------------------------------------------
void STEP_MOTOR_RUN(INT8U Direction,INT8U n)
{ 


}
 
//-----------------------------------------------------------------
// 主程序 
//-----------------------------------------------------------------
int main()
{ 



}
