//-----------------------------------------------------------------
//  名称: PG160128中文显示日期时间及带刻度显示当前温度
//-----------------------------------------------------------------
//  说明: 本例运行时,液晶屏上将用中文刷新实时显示当前日期时间与
//        当前温度信息,同时以图形方式动态显示当前温度.
//                          
//-----------------------------------------------------------------
#include <avr/io.h>
#include <avr/interrupt.h>
#include <util/delay.h>
#include <stdio.h>
#include <math.h>
#define INT8    signed   char
#define INT8U   unsigned char
#define INT16U  unsigned int
#define INT32U  unsigned long

//PG160128D相关函数



//DS1302实时时钟程序相关函数与变量



//DS18B20温度传感器相关函数与变量



//LCD字符串显示缓冲
char Disp_Str_Buffer[14];
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{


}

//-----------------------------------------------------------------
// 刷新温度指示线条
//-----------------------------------------------------------------
void Refresh_Temp_Indicator()
{


}

//-----------------------------------------------------------------	
// 定时器0刷新LCD显示(每次均备份上次读取的时间与温度,显示前进行比较,
// 如果变化则刷新显示,这样可减少液晶屏的显示抖动)	 
//-----------------------------------------------------------------
ISR (TIMER0_OVF_vect)
{


}
