//-----------------------------------------------------------------
//  名称: 八只数码管滚动显示单个字符
//-----------------------------------------------------------------
//  说明: 数码管从左到右依次滚动显示0-7 
//        程序通过每次仅循环选通一只数码管实现单只数码管滚动显示效果
//
//-----------------------------------------------------------------
#define F_CPU   4000000UL  //4MHZ
#include <avr/io.h>
#include <util/delay.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//各数字的数码管段码
const INT8U SEG_CODE[]={0xC0,0xF9,0xA4,0xB0,0x99,0x92,0x82,0xF8,0x80,0x90};
//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{


}
