//-----------------------------------------------------------------
//  名称: 用TWI接口控制MAX6955驱动16段数码管
//-----------------------------------------------------------------
//  说明: 本例运行时,8只16段数码滚动显示数字0~9,字母A~Z
//        本例使MAX6955工作于全解码模式,因此只需要向MAX6955输出
//        待显示字符ASCII码即可,不需要编写并发送各字符的段码.
//
//----------Proteus中单只16段数码管上下排引脚名称------------------
// NO.  1   2   3  4   5   6   7  8   9
//******************************************
// 上:  A1  A2  B  C   D2  D1  E  F   位控制
// 下:  H   I   J  G2  K   I   M  G1  DP
//-----------------------------------------------------------------
#define F_CPU 4000000UL
#include <avr/io.h>
#include <util/twi.h>
#include <util/delay.h>
#include <string.h>
#define INT8U   unsigned char
#define INT16U  unsigned int

//子器件地址0xC0,0xC1



//TWI通用操作




//16段数码管滚动显示的字符串
char SEG_LED_String[] = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
//-----------------------------------------------------------------
// 写MAX6955子程序
//-----------------------------------------------------------------
INT8U MAX6955_Write(INT8U addr, INT8U dat)
{


}

//-----------------------------------------------------------------
// MAX6955初始化
//-----------------------------------------------------------------
void MAX6955_INIT()
{


}

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main()
{


}
